raibisch/ESP32_ABL/src/main.cpp

#include <Arduino.h>
#include "SPI.h"
#include <SPIFFS.h>
#include <WiFi.h>
#include "WiFiGeneric.h"
#include "math.h"
//#include <ArduinoOTA.h>
//#include <esp_ota_ops.h>
#include <AsyncTCP.h>

// now set in platformio.ini
//#define DEBUGPRINT 1    // SET TO 0 OUT TO REMOVE TRACES

#ifdef DEBUG_PRINT
#define debug_begin(...) Serial.begin(__VA_ARGS__);
#define debug_print(...) Serial.print(__VA_ARGS__);
#define debug_write(...) Serial.write(__VA_ARGS__);
#define debug_println(...) Serial.println(__VA_ARGS__);
#define debug_printf(...) Serial.printf(__VA_ARGS__);
#else
#define debug_begin(...)
#define debug_print(...)
#define debug_printf(...)
#define debug_write(...)
#define debug_println(...)
#endif


#include <ESPAsyncWebServer.h>
#include "ESP32Time.h"

//#include <AsyncElegantOTA.h>

// fuer EEPROM Emulation
#include <Preferences.h>

#include "FileVarStore.h"
#include "AsyncWebLog.h"
#include "AsyncWebOTA.h"

 
#define EEPROM_SIZE 12

#ifdef DEF_S2_MINI
#pragma message(": warning CuteCom>: Set DTR for Serial-communication")
#endif

#define ABL_RXD_GPIO 39
#define ABL_TXT_GPIO 37
#define ABL_RX_LOW_ENABLE_GPIO 35
//#define ABL_TX_HIGH_ENABLE_GPIO 33 
#define LED_GPIO  15


#define ABL_ENABLE_TX HIGH
#define ABL_ENABLE_RX LOW

/*
Set I-Soll:
=======
6A:
:01100014000102006474

7A:
:01100014000102007563

8A:
:01100014000102008553

9A:
:01100014000102009642

10A:
:0110001400010200A731

11A:
:0110001400010200B721

12A:
:0110001400010200C810

13A:
0110001400010200D9FF

14A:
:0110001400010200E9EF

15A:
:0110001400010200FADE

16A:
:01100014000102010BCC

*/

const char* ABL_TX_POLL_MESSAGE   = ":0103002E0005C9";
const char* ABL_TX_SET_6A         = ":01100014000102006474";
const char* ABL_TX_SET_8A         = ":01100014000102008553";
const char* ABL_TX_SET_10A        = ":0110001400010200A632";                                
const char* ABL_TX_SET_12A        = ":0110001400010200C810";
const char* ABL_TX_SET_14A        = ":0110001400010200E9EF";
const char* ABL_TX_SET_15A        = ":0110001400010200FADE";
const char* ABL_TX_SET_16A        = ":01100014000102010BCC";
const char* ABL_TX_SET_DISABLE    = ":0110001400010203E8ED";  

HardwareSerial Serial_ABL(1);

ESP32Time rtc(0);  

AsyncWebServer server(80);
const char* PARAM_MESSAGE = "message";


enum ABL_POLL_STATUS {
  POLL_Current,      // implemented and testet
  SET_Current,       // implemented and tested
  SET_StopCharge,    // implemented (ABL_TX_SET_DISABLE)
  SET_RestartCharge, // implemented (SET_CURRENT after SET_CURRENT x3E8)
  SET_DISABLE_WB,    // todo not implemented
  SET_ENABLE_WB,     // todo not implemented
  POLL_FIRMWARE      // todo not implemented
};


// !! same nummer of elements as ABL_STATUS_STRING !!
enum ABL_STATUS { 
ABL_A1=0,     // not connected,  Waiting for EV 
ABL_B1,       // connected, EV is asking for charging
ABL_B2,       // connected, EV hat the permission to charge
ABL_C2,       // connected, EV in charging 
ABL_C3,       // connected, EV in charging reduced current
ABL_C4,       // connected, EV in charging reduced current
ABL_UNVALID,  // 
ABL_TIMEOUT   // no Rx after 2x Polltimes
};

const String ABL_STATUS_STRING[] = { 
 
"A1",     // not connected,  Waiting for EV 
"B1",     // connected, EV is asking for charging
"B2",     // connected, EV hat the permission to charge
"C2",     // connected, EV in charging 
"C3",     // connected, EV in charging reduced current
"C4",     // connected, EV in charging reduced current
"??",     // unvalid
"noCom"   // timeout or no connection
};

/*
not extra handeled but displayed status messages (from ABL docu):
=================================================================
E0 Outlet disabled
E1 Production test
E2 EVCC setup mode
E3 Bus idle
F1 Unintended closed contact (Welding)
F2 Internal error
F3 DC residual current detected
F4 Upstream communication timeout
F5 Lock of socket failed
F6 CS out of range
F7 State D requested by EV
F8 CP out of range
F9 Overcurrent detected
F10 Temperature outside limits
F11 Unintended opened contactd
*/


static unsigned long ABL_PollTime_old = 0;
static unsigned long ABL_StatusSec_old = 0;
static unsigned long ABL_kwh_StartTime = 0;
static unsigned long ABL_Wh_Sum_akt = 0;
static unsigned long ABL_Wh_Sum_old = 0;
//static unsigned long ABL_pollPeriod = 30000;    // jetz über Config Polling period

// VALUES from ABL
// jetzt über Config
// varABL_i_U_netz
//static uint ABL_rx_VOLT= 230;          // default = 230V

static float ABL_rx_Ampere = 0.0;
static float ABL_rx_kW = 0.0;
static float ABL_rx_kWh = 0.0;          // calculated value !!
static String ABL_rx_status = ABL_STATUS_STRING[ABL_UNVALID];
static bool ABL_rx_aktiv = 0;

static enum ABL_POLL_STATUS ABL_tx_status = POLL_Current;
// Values to ABL
static uint ABL_tx_Ampere   = 6;
static String ABL_rx_String = "";          // a String to hold incoming data
static uint16_t ABL_rx_timeoutcount = 0;  



static long int HexString2int(String s)
{
  const String hexDigits = "0123456789ABCDEF";
  long int result = 0;
  s.toUpperCase();
  for (int i = 0; i < s.length(); i++) {
    result <<= 4;
    result |= hexDigits.indexOf(s[i]);
  }
  
  return result;
}


// UINT64 in String wandeln (geht nicht mit standard "String()")
//old version see below !!
String uint64ToString(uint64_t input)
{
  String result = "";
  uint8_t base = 10;

  do
  {
    char c = input % base;
    input /= base;

    if (c < 10)
      c += '0';
    else
      c += 'A' - 10;
    result = c + result;
  } while (input);
  return result;
}

// from comment from "milenko-s"
// to be testet
String uint64ToString_new(uint64_t input)
{
  String result = "";
  uint8_t base = 10;

  do
  {
    char c = input % base;
    input /= base;

    //if (c < 10)
      c += '0';
    //else
    //  c += 'A' - 10;
    result = c + result;
  } while (input);
  return result;
}

  

/* ------------------until now not used--------------------------

static String ByteToAscii(byte input) 
{
  char singleChar, out;
  char asciiString[2+1] {0,0,0}; 
  sprintf(asciiString, "%2X", input);
  return String(asciiString);
}


char ByteToAscii(const char *input) 
{
  char singleChar, out;
  memcpy(&singleChar, input, 2);
  sprintf(&out, "%c", (int)strtol(&singleChar, NULL, 16));
  return out;
}


static byte calculateLRC(String s)
{
    byte LRC = 0;
    for (int i = 0; i < s.length(); i++)
    {
        LRC ^= (byte)s[i];
    }
    return LRC;
}
---------------------------not used -------------------------*/

void initLED()
{
  pinMode(LED_GPIO, OUTPUT);
  digitalWrite(LED_GPIO, HIGH);
}

