raibisch/ESP32_ABL/src/main.cpp
void setLED(uint8_t i)
{
  digitalWrite(LED_GPIO, i);
}

static uint8_t blinkcounter = 0;
static void blinkLED()
{
   digitalWrite(LED_GPIO,blinkcounter % 2);
   blinkcounter++;
}



class ABL_FileVarStore : public FileVarStore
{
 public:  
  // Device-Parameter
   String varDEVICE_s_Name  = "Wallbox";

   // ABL-Parameter
   int varABL_i_A_soll_high = 14;
   int varABL_i_A_soll_low  = 6;
   int varABL_i_U_netz = 230;
   int32_t varABL_i_Scantime_ms = 30000;

  // Wifi-Parameter
   String varWIFI_s_Mode    = "STA"; // STA=client connect with Router,  AP=Access-Point-Mode (needs no router)
   String varWIFI_s_Password= "mypassword";
   String varWIFI_s_SSID    = "myssid";

   String varWIFI_s_IpAdr   = "00.00.00.00"; // wird noch ueberschrieben

 protected:
   void GetVariables()
   {
     varDEVICE_s_Name     = GetVarString(GETVARNAME(varDEVICE_s_Name));
     varWIFI_s_Mode       = GetVarString(GETVARNAME(varWIFI_s_Mode)); //STA or AP
     varWIFI_s_Password   = GetVarString(GETVARNAME(varWIFI_s_Password));
     varWIFI_s_SSID       = GetVarString(GETVARNAME(varWIFI_s_SSID));

     varABL_i_U_netz      = GetVarInt(GETVARNAME(varABL_i_U_netz));
     varABL_i_A_soll_low  = GetVarInt(GETVARNAME(varABL_i_A_soll_low));
     varABL_i_A_soll_high = GetVarInt(GETVARNAME(varABL_i_A_soll_high),16);
     varABL_i_Scantime_ms = GetVarInt(GETVARNAME(varABL_i_Scantime_ms),30000);
   }
};
ABL_FileVarStore varStore;

void initFileVarStore()
{
  varStore.Load();
}



static void forcePolling()
{
      ABL_PollTime_old  = millis() + varStore.varABL_i_Scantime_ms;
}

 
bool testTimeount()
{
        ABL_rx_timeoutcount++;
        if (ABL_rx_timeoutcount > 2)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_TIMEOUT];
          return true;
        }
        return false;
}

// ---- EEPROM Simulation to save Values over Reset and Poweroff-------
Preferences hist;

void initHistory()
{
   hist.begin("history", false); // use history
   ABL_Wh_Sum_old = hist.getULong64("whsum",0);
}


bool set_Wh_Sum(unsigned long whs)
{
  hist.putULong64("whsum", whs);
  return true;
}


unsigned long get_Wh_Sum()
{
  return hist.getULong64("whsum",0);
}

static uint HistoryCount = 0;
bool saveHistory()
{
  HistoryCount++;
  if (HistoryCount > 960) // save every 8h with polling time 30sec
  {
   hist.putULong64("whsum",ABL_Wh_Sum_akt);
   HistoryCount = 0;
  }
  
  ABL_Wh_Sum_akt = ABL_Wh_Sum_old + u_long(ABL_rx_kWh*1000);

  return true;
}
// ----  END EPROM Simulation -----------------------------------------

/// @brief Init ABL communication over RS485
void ABL_init()
{
    Serial_ABL.begin(38400, SERIAL_8E1, ABL_RXD_GPIO, ABL_TXT_GPIO);
    ABL_rx_String="";
    //ABL_rx_String.reserve(200);
    pinMode(ABL_RX_LOW_ENABLE_GPIO, OUTPUT_OPEN_DRAIN);
    digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0);
    delay(1);
    //Serial_ABL.flush();
    while(Serial_ABL.available())
    {Serial_ABL.read();}
    debug_println("ABL_init OK!");
}

/// @brief Send to ABL
/// @param s 
void ABL_Send(ABL_POLL_STATUS s)
{
 String tx = "";

 switch (s)
 {
  case POLL_Current:
    tx = String(ABL_TX_POLL_MESSAGE);
  break;

  case SET_Current:
    switch (ABL_tx_Ampere)
    {
      case 0:
        tx = String(ABL_TX_SET_DISABLE);
      break;
      
      case 5:
      case 6:
       tx = String(ABL_TX_SET_6A);
      break;

      case 7:
      case 8:
         tx = String(ABL_TX_SET_8A);
      break;

      case 9:
      case 10:
          tx = String(ABL_TX_SET_10A);
      break;

      case 11:
      case 12:
           tx = String(ABL_TX_SET_12A);
      break;

      case 13:
      case 14:
          tx = String(ABL_TX_SET_14A);
      break;

      case 15:
         tx = String(ABL_TX_SET_15A);
      break;

      case 16:
          tx = String(ABL_TX_SET_16A);
      break;

      default:
          tx = String(ABL_TX_SET_6A);
      break;
    }
  break; // End Set_Current

  //todo: additional Tx-Commands
  // 
  // ModifyState: Register 0x05
  // Enable:  A1A1
  // Disable: E0E0 
  
  // GetFirmware: Register 0x01
  
  
  default:
  break;
 }
 AsyncWebLog.println("TX" + tx);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1);
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // Switch from TX to RX
 delay(1000);
 // empty the first rx input because of possible trash after first ABL-wakeup call
 while (Serial_ABL.available()) 
 {
    char inChar = (char)Serial_ABL.read();
 }
 // send 2x for wakeup from sleep
 digitalWrite(ABL_RX_LOW_ENABLE_GPIO,1); // Switch form Rx to TX
 for (int i =0; i< tx.length(); i++)
 {
  Serial_ABL.write(tx[i]);
 }
 Serial_ABL.write("\r\n");
 Serial_ABL.flush(true);

 digitalWrite(ABL_RX_LOW_ENABLE_GPIO, 0); // switch from Tx to Rx
}

 /// @brief Parse the received Data from ABL
 /// @param s 
 bool ABL_ParseReceive(String s)
 {
/*
Register 0x002E Read current (full)
   r/w Reg leng, LRC
   r  46d   5
:01 03 002E 0005 C9   

Send: 
:0103002E0005C9
Answer: (Status A1 = not connected)
>01030A2EA1108503E803E803E8CD


                      0=not connected
                      0=not reduced
                      0=EN2 open
                      1=EN1 closes 
      Cnt Reg    State   0001       Imax       Ip1  Ip2  Ip3  LRC
      10                         133dx0.06
                                 = 8A
>01 03 0A 2E      A1     10        85          03E8 03E8 03E8 CD
cnt:               0      1         2          3 4  5 6  7 8 
>01 03 0A 2E      A1     10        64          03E8 03E8 03E8 EE
                                 100dx0.06
                                 =  6A
*/
  bool ret = false;
  if (s.startsWith(">01030A2E") && s.length()>=28 )  // 2E = Read current (full)
  {
       AsyncWebLog.println("Status:" + s.substring(9,11)+ " Ipwm:" + s.substring(13,15) + " I1:" + s.substring(15,19) +  + " I2:" + s.substring(19,23) + " I3:" + s.substring(23,27));  
       ABL_rx_status = s.substring(9,11);
       try
       {
         ABL_rx_Ampere = round(HexString2int(s.substring(12,15)) * (float)0.06);
         uint32_t i1,i2,i3 =0;
        
         i1 = HexString2int(s.substring(15,19));
         if (i1 > 900)
         {i1=0;}

         i2 = HexString2int(s.substring(19,23));
         if (i2 > 900)
         {i2=0;}

         i3 = HexString2int(s.substring(23,27));
         if (i3 > 900)
         {i3=0;}
         
