raibisch/ESP32_ABL/src/main.cpp
         uint32_t iges10= i1 +i2 + i3;
         //ABL_rx_kW = round((iges*(int)varStore.varABL_i_U_netz)/100.0)/10.0;
         if ((iges10) > 0)
         {
          ABL_rx_kW = uint32_t(iges10*varStore.varABL_i_U_netz)/float(10000.0);
         }
         else
         {
          ABL_rx_kW = 0;
         }

         AsyncWebLog.println("Ipwm="+ String(ABL_rx_Ampere)+  " I="+ String(i1/10.0)+ "+" + String(i2/10.0) +"+" +String(i3/10.0) +"+ Isum="+ String(iges10/10.0) + " Psum=" + String(ABL_rx_kW)+ "\r\n");
         ret = true;
      
       }
       catch(const std::exception& e)
       {
         ABL_rx_Ampere = 0;
         AsyncWebLog.println("*Exeption*");
       }
       
  }
  else
  if (s.startsWith(">011000140001DA")) // 14 = set Imax OK (duty cycle)
  {
    // >011000140001DA
    AsyncWebLog.println("*RX Set-Imax OK*");
    ABL_tx_status = POLL_Current;  // next Command
    forcePolling();
  }
  else
  if (s.startsWith(">01"))
  {
     AsyncWebLog.println("*RX-UNKNOWN!:" + s);
  }
  else
  {
    AsyncWebLog.println("*RX-UNVALID!");
    ABL_rx_status = ABL_STATUS_STRING[ABL_UNVALID];
  }

  ABL_rx_String = "";
  return ret;
 }



void serialEventABL() 
{
    while (Serial_ABL.available()) 
    {
     char inChar = (char)Serial_ABL.read();
     ABL_rx_String += inChar;
     if (inChar == '\n') 
     {
      AsyncWebLog.println("RX"+ ABL_rx_String);
      if (ABL_ParseReceive(ABL_rx_String))
      {
        ABL_rx_timeoutcount = 0;
      }
      ABL_rx_String = "";
      delay(1000);
      setLED(0); // LED off
    }
   } // while
}


void initWifi()
{
  // Test mit AP !!!!!!!!!!!!!!!!!!!!!
  //varStore.varWIFI_s_Mode="AP";
  // !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
   if (varStore.varWIFI_s_Mode == "AP")
   {
    delay(100);
    debug_println("INFO-WIFI:AP-Mode");
    WiFi.softAP(varStore.varDEVICE_s_Name.c_str());   
    debug_print("IP Address: ");
    varStore.varWIFI_s_IpAdr = WiFi.softAPIP().toString();
    debug_println(varStore.varWIFI_s_IpAdr);
   }
   else
   {
    debug_printf("INFO-WIFI:STA-Mode\r\n");
    WiFi.setTxPower(WIFI_POWER_19_5dBm); // maximum !!
    WiFi.mode(WIFI_STA);
    WiFi.setTxPower(WIFI_POWER_19_5dBm);
    WiFi.setHostname(varStore.varDEVICE_s_Name.c_str());
    WiFi.begin(varStore.varWIFI_s_SSID.c_str(), varStore.varWIFI_s_Password.c_str());
    int i = 0;
    delay(500);
    debug_printf("SSID:%s\r\n", varStore.varWIFI_s_SSID);
    ///debug_printf("Passwort:%s\r\n", varStore.varWIFI_s_Password);
    while ((WiFi.waitForConnectResult() != WL_CONNECTED) && (i < 5))
    {
        delay(300);
        debug_printf(".");
        setLED(i%2);
        i++;  
    }
    if (WiFi.waitForConnectResult() == WL_CONNECTED)
    {
      debug_print("IP Address: ");
      varStore.varWIFI_s_IpAdr = WiFi.localIP().toString();
      debug_println(varStore.varWIFI_s_IpAdr);
      return;
    }
    else
    {
      ESP.restart();
    }
   }

  return;
}

static String readString(File s) 
{
  String ret;
  int c = s.read();
  while (c >= 0) {
    ret += (char)c;
    c = s.read();
  }
  return ret;
}

// -------------------- WEBSERVER ----------------------------------------------
// -----------------------------------------------------------------------------
//


/// @brief replace placeholder "%<variable>%" in HTML-Code
/// @param var 
/// @return String
String setHtmlVar(const String& var)
{
  debug_print("func:setHtmlVar: ");
  debug_println(var);
 
  if (var == "CONFIG") // read config.txt
  {
    if (!SPIFFS.exists("/config.txt")) 
    {
     return String(F("Error: File 'config.txt' not found!"));
    }
    // read "config.txt" 
    fs::File configfile = SPIFFS.open("/config.txt", "r");   
    String sConfig;     
    if (configfile) 
    {
      sConfig = readString(configfile);
      configfile.close();
    }

    else 
    { // no "config.txt"
      sConfig = "";
    }
    return sConfig;
  } 
  else
  if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_Name;
  }
  if (var== "I-HIGH")
  {
    return "I-HIGH(" + String(varStore.varABL_i_A_soll_high) + "A)";
  }
  else
   if (var== "DEVICEID")
  {
    return varStore.varDEVICE_s_Name;
  }
  else
  if (var== "I-LOW")
  {
    return "I-LOW(" + String(varStore.varABL_i_A_soll_low) + "A)";
  }
  else
  if (var == "KWHSUM")
  {
    float f = 0.00;
    if (ABL_Wh_Sum_akt > 0)
    {
      f = ABL_Wh_Sum_akt / 1000.00;
    }
    return String(f);
  } 


  return String();
}

void notFound(AsyncWebServerRequest *request) {
    request->send(404, "text/plain", "Not found");
}

// for "/" and "/index" handle post
void Handle_Index_Post(AsyncWebServerRequest *request)
{
   debug_println("Argument: " + request->argName(0));
   debug_println("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   //debug_println(s);
   //String sRet = "";
   if (request->argName(0) == "ihigh")
   {
     //ABL_Send("high");
     forcePolling();
     ABL_tx_Ampere = varStore.varABL_i_A_soll_high;
     ABL_tx_status = SET_Current;
   }
   else
   if (request->argName(0) == "ilow")
   {
       //sRet = ABL_Send("low");
       forcePolling();
       ABL_tx_Ampere = (int)varStore.varABL_i_A_soll_low;
       ABL_tx_status = SET_Current;
   }
   else
   if (request->argName(0) == "pause")
   {
       //sRet = ABL_Send("low");
       forcePolling();
       ABL_tx_Ampere = 0;
       ABL_tx_status = SET_Current;
      AsyncWebLog.println("CHARGE-PAUSE");

    }

   AsyncWebLog.println("SET-Current:" + String(ABL_tx_Ampere) + "A");
   
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
}

void initWebServer()
{ 
  //Route for root / web page
  server.on("/",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
  });


  //Route for root /index web page
  server.on("/index.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/index.html", String(), false, setHtmlVar);
  });

  

  //Route for setup web page
  server.on("/setup.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setup.html", String(), false, setHtmlVar);
  });


  //Route for config web page
  server.on("/config.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });

  
  //Route for stored values
  server.on("/setvalues.html",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/setvalues.html", String(), false, setHtmlVar);
  });


  // Route for style-sheet
  server.on("/style.css",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/style.css", String(), false);
  });


