raibisch/ESP32_ABL/src/main.cpp
  // fetch GET
  server.on("/fetch", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    
    // fetch is also used for setting Imax with URL-Variable
    // example: 
    // http://<your-ip>/fetch?imax=8 --> set Imax to 8A
    //
    // valid values: imax=0..6..8..10..12..14..15..16 
    // specal case imax=0 --> Pause charging
    if (request->args() > 0)
    {
    debug_println("GET-Argument: " + request->argName(0));
    debug_print("Value: ");
    uint8_t i = 0;
    String s  = request->arg(i);
    debug_println(s);
    if (request->argName(0) == "imax")
    {
       forcePolling();
       uint a = String(request->arg(i)).toInt();
       AsyncWebLog.println("GET-SET-Imax:" + String(a)+ "A");
       if ((a >=6 && a <=16) || (a==0))
       {
           ABL_tx_Ampere = a;
           ABL_tx_status = SET_Current; // next Send Protocol
       }
       else
       {
        AsyncWebLog.println("**ERROR Imax out of range!");
       }
    }
    }

    // return actual values
    // REMARK: if you change Imax it needs one more GET to return the actual value of Imax
    String s = String(ABL_rx_Ampere)+',' + String(ABL_rx_kW) + ','+ ABL_rx_status+ ',' + String(ABL_rx_kWh)+ ',' + String(ABL_Wh_Sum_akt);
    request->send(200, "text/plain", s);
    //debug_println("server.on /fetch: "+ s);
  });

  // config.txt GET
  server.on("/config.txt", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send(SPIFFS, "/config.txt", "text/html", false);
  });

  
  // config.txt GET
  server.on("/reboot.html", HTTP_GET, [](AsyncWebServerRequest *request)
  {
    request->send(404, "text/plain", "RESTART !");
    ESP.restart();
  });

  //.. some code for the navigation icons


  // ...a lot of code only for icons and favicons ;-))
  server.on("/home.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/home.png", String(), false);
  });

  server.on("/file-list.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/file-list.png", String(), false);
  });
  server.on("/settings.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/settings.png", String(), false);
  });




  // ...a lot of code only for icons and favicons ;-))
  server.on("/manifest.json",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/manifest.json", String(), false);
  });
  server.on("/favicon.ico",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/favicon.ico", String(), false);
  });
  server.on("/apple-touch-icon.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/apple-touch-icon.png", String(), false);
  });
  server.on("/android-chrome-192x192.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-192x192.png", String(), false);
  });
  server.on("/android-chrome-384x384.png",          HTTP_GET, [](AsyncWebServerRequest *request)
  {
   request->send(SPIFFS, "/android-chrome-384x384.png", String(), false);
  });

  // ------------ POSTs --------------------------------------------------------------------------
  // root (/) POST
  server.on("/",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });

  // index.html POST
  server.on("/index.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
    Handle_Index_Post(request);
  });
  
  
  // config.html POST
  server.on("/config.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   //debug_println("Argument: " + request->argName(0));
   //debug_println("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "saveconfig")
   {
       varStore.Save(s);
       varStore.Load();
   }
   if (request->argName(0) == "reboot")
   {
       //history_save();
       ESP.restart();
   }
   //debug_println("Request /index3.html");
   request->send(SPIFFS, "/config.html", String(), false, setHtmlVar);
  });
  
  
  // setvalues.html POST
  server.on("/setvalues.html",          HTTP_POST, [](AsyncWebServerRequest *request)
  {
   debug_println("Argument: " + request->argName(0));
   debug_print("Value: ");
   uint8_t i = 0;
   String s  = request->arg(i);
   debug_println(s);
   if (request->argName(0) == "kwh") // kW/h Sum
   {
      ABL_Wh_Sum_akt = u_long(s.toFloat()*1000);
      debug_print("ABL_Wh_Sum_akt: ");
      debug_println(ABL_Wh_Sum_akt);
      set_Wh_Sum(ABL_Wh_Sum_akt);
      ABL_Wh_Sum_old = ABL_Wh_Sum_akt;
   }    
   request->send(SPIFFS, "/setvalues.html", String(), false, setHtmlVar);
  });
  
  

   /*
   // Send a GET request to <IP>/get?message=<message>
  server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request) {
        String message;
        if (request->hasParam(PARAM_MESSAGE)) {
            message = request->getParam(PARAM_MESSAGE)->value();
        } else  // Serious problem{
            message = "No message sent";
        }
        request->send(200, "text/plain", "Return Value from GET: " + message);
  });

  // Send a POST request to <IP>/post with a form field message set to <message>
  server.on("/post", HTTP_POST, [](AsyncWebServerRequest *request){
        String message;
        if (request->hasParam(PARAM_MESSAGE, true)) {
            message = request->getParam(PARAM_MESSAGE, true)->value();
        } else {
            message = "No message sent";
        }
        request->send(200, "text/plain", "Hello, POST: " + message);
  });
  */

  
  server.onNotFound(notFound);

  AsyncWebLog.begin(&server);
  AsyncWebOTA.begin(&server);
  server.begin();
}


void initSPIFFS()
{
  if (!SPIFFS.begin())
  {
   debug_println("*** ERROR: SPIFFS Mount failed");
  } 
  else
  {
   debug_println("* INFO: SPIFFS Mount succesfull");
  }
}


// --------------------------------------------
void setup()
{
  delay(800);
  debug_begin(115200);  
  delay(800);
  debug_println("Setup-Start");
  initSPIFFS();
  initLED();
  initFileVarStore();
  initHistory();
  initWifi();
  delay(400);
  initWebServer();
  ABL_init();
  delay(400);
  forcePolling();
  //rtc.setTime(0);
}


uint log_timer =0;

void loop()

{
     unsigned long now = millis();
 
    if ((now - ABL_PollTime_old) >= varStore.varABL_i_Scantime_ms)
    {
       ABL_PollTime_old  = now;
       log_timer = varStore.varABL_i_Scantime_ms / 1000;
        //if (ABL_rx_status.startsWith("A")) // for test without EV
        if ((ABL_rx_status.startsWith("C")) && (ABL_rx_kW > 0))
        {
         //ABL_rx_kWh = ABL_rx_kWh + ( 10.0    /(3600/(varStore.varABL_i_Scantime_ms/1000))); // for test without EV
        
        ABL_rx_kWh = ABL_rx_kWh + (ABL_rx_kW/(3600/(varStore.varABL_i_Scantime_ms/1000)));
        debug_print("kWh: ");
        debug_println(ABL_rx_kWh);
        }
        else
        if (ABL_rx_status.startsWith("no"))
        {
          //ABL_rx_kW = 0;
          hist.putULong64("whsum",ABL_Wh_Sum_akt);
          //ESP.restart();
        }

        setLED(1);
        ABL_Send(ABL_tx_status);
        testTimeount(); 
        saveHistory();
    }
    else
    {
        serialEventABL();
    }

    if (now -ABL_StatusSec_old >= 1000)
    {
      ABL_StatusSec_old = now;
      log_timer = log_timer -1;
      String s = "Next Polling in :" + String(log_timer) + ("sec");
      AsyncWebLog.println(s);
    }
  
 
}

